data/sysbench/ext4/rndrw/150G/sdb1thread20
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      68.02
    writes/s:                     45.38
    fsyncs/s:                     45.38

Throughput:
    read, MiB/s:                  1.06
    written, MiB/s:               0.71

General statistics:
    total time:                          60.1719s
    total number of events:              6824

Latency (ms):
         min:                                  0.01
         avg:                                176.14
         max:                                567.10
         95th percentile:                    442.73
         sum:                            1201966.16

Threads fairness:
    events (avg/stddev):           341.2000/28.77
    execution time (avg/stddev):   60.0983/0.07