data/sysbench/ext4/rndrw/150G/sdb1thread30
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 30
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      76.85
    writes/s:                     51.57
    fsyncs/s:                     51.57

Throughput:
    read, MiB/s:                  1.20
    written, MiB/s:               0.81

General statistics:
    total time:                          60.1813s
    total number of events:              7729

Latency (ms):
         min:                                  0.01
         avg:                                233.49
         max:                                777.56
         95th percentile:                    590.56
         sum:                            1804673.86

Threads fairness:
    events (avg/stddev):           257.6333/23.11
    execution time (avg/stddev):   60.1558/0.03