data/sysbench/ext4/rndrw/150G/sdb1thread40
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      85.44
    writes/s:                     56.62
    fsyncs/s:                     56.62

Throughput:
    read, MiB/s:                  1.34
    written, MiB/s:               0.88

General statistics:
    total time:                          60.2601s
    total number of events:              8561

Latency (ms):
         min:                                  0.01
         avg:                                280.91
         max:                                912.06
         95th percentile:                    707.07
         sum:                            2404839.21

Threads fairness:
    events (avg/stddev):           214.0250/28.33
    execution time (avg/stddev):   60.1210/0.08