data/sysbench/ext4/rndrw/150G/sdc1thread20
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 20
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1954.98
    writes/s:                     1303.57
    fsyncs/s:                     1303.57

Throughput:
    read, MiB/s:                  30.55
    written, MiB/s:               20.37

General statistics:
    total time:                          60.0095s
    total number of events:              195555

Latency (ms):
         min:                                  0.01
         avg:                                  6.13
         max:                                 39.03
         95th percentile:                     19.29
         sum:                            1199416.10

Threads fairness:
    events (avg/stddev):           9777.7500/160.92
    execution time (avg/stddev):   59.9708/0.00