data/sysbench/ext4/rndrw/150G/sdd1thread50
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      6894.80
    writes/s:                     4596.85
    fsyncs/s:                     4596.85

Throughput:
    read, MiB/s:                  107.73
    written, MiB/s:               71.83

General statistics:
    total time:                          60.0046s
    total number of events:              689591

Latency (ms):
         min:                                  0.01
         avg:                                  4.34
         max:                                 38.90
         95th percentile:                     11.24
         sum:                            2994366.95

Threads fairness:
    events (avg/stddev):           13791.8200/114.47
    execution time (avg/stddev):   59.8873/0.00